# Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [90]:
df = pd.DataFrame(data, labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 1. Вывести информацию о датафрейме.

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [5]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [18]:
df.loc[:,'animal':'age']

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [19]:
df.iloc[[3,4,8],0:2]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [20]:
df[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [21]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [24]:
df[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [25]:
df[(df['age'] >= 2) & (df['age'] <= 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [32]:
df.at['f', 'age'] = 1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 10. Рассчитать общее количество всех посещений.

In [33]:
np.sum(df['visits'])

19

#### 11. Расчитайте суммарный возраст животных

In [34]:
np.sum(df['age'])

27.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [58]:
k = pd.DataFrame({'animal': ['python'], 'age': [29], 'visits': [np.nan], 'priority': ['yes']}, {'k'})
df.append(k)

   animal     age  visits priority
a      no      no      no       no
b      no      no      no       no
c  python  python  python   python
d      no      no      no       no
e     dog       5       2       no
f     cat     1.5       3       no
g  python  python  python   python
h      no      no      no       no
i     dog       7       2       no
j     dog       3       1       no
k  python      29     NaN      yes

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [48]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [93]:
df.sort_values(by=['age', 'visits'], ascending=[True, True])

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
b    cat  3.0       3      yes
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [95]:
df.loc['a':,'priority'][(df['priority'] == 'yes')] = 'no'
df

  animal  age  visits priority
a    cat  2.5       1       no
b    cat  3.0       3       no
c  snake  0.5       2       no
d    dog  NaN       3       no
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1       no
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 16. В столбце «animal» измените записи «snake» на «python».

In [96]:
df.loc['a':,'animal'][(df['animal'] == 'snake')] = 'python'
df

   animal  age  visits priority
a     cat  2.5       1       no
b     cat  3.0       3       no
c  python  0.5       2       no
d     dog  NaN       3       no
e     dog  5.0       2       no
f     cat  2.0       3       no
g  python  4.5       1       no
h     cat  NaN       1       no
i     dog  7.0       2       no
j     dog  3.0       1       no

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [110]:
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.drop_duplicates(inplace=True)
df

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [127]:
df = pd.DataFrame (np.random.random ((5, 10)), columns = ['a', 'b','c','d','e','f','g','h','i','j'])
df

,a,b,c,d,e,f,g,h,i,j
0,0.749019,0.859036,0.933460,0.352432,0.884436,0.206732,0.504317,0.160933,0.048143,0.901508
1,0.740923,0.213558,0.681330,0.082026,0.533224,0.519816,0.624049,0.409276,0.726868,0.249273
2,0.545936,0.922377,0.000397,0.909232,0.052802,0.223244,0.939550,0.792211,0.718144,0.741499
3,0.558967,0.834997,0.860575,0.031074,0.095986,0.932358,0.705398,0.897334,0.864407,0.502886
4,0.822697,0.735599,0.088149,0.157029,0.415781,0.401486,0.995563,0.035342,0.382250,0.942510

In [131]:
m = np.inf
for col in df.columns:
    if df.loc[:, col].sum() < m:
        m = df.loc[:, col].sum()
        mark = col
print('min_sum =', m, 'in', mark)

min_sum = 1.5317925296881518 in d

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [140]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [142]:
df['value'].fillna(df['value'].median(),inplace=True)
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    3.0
4      a    2.0
5      b    3.0
6      b    3.0
7      b    1.0
8      a    7.0
9      b    3.0
10     a    3.0
11     b    8.0

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [158]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [159]:
def get_from_to(s):
    fr = ''
    to = ''
    f = True
    for c in s:
        if(c != '_') & (f == True):
            if len(fr) == 0:
                fr += c.upper()
            else:
                fr += c.lower()
        else: 
            f = False
            
        if(c != '_') & (f == False):
            if len(to) == 0:
                to += c.upper()
            else:
                to += c.lower()
    return fr,to

In [162]:
froms, tos = [],[]
for fr_to in df['From_To']:
    f, t = get_from_to(fr_to)
    froms.append(f)
    tos.append(t)
df['From'] = froms
df['To'] = tos
df.drop('From_To', axis=1, inplace=True)
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London